packages/inductiva/inductiva-0.0.31.tar.gz/inductiva-0.0.31/inductiva/templates/heat_sink/openfoam/files/constant/fluid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Air

    specie
    {
        nMoles      1;
        molWeight   28.9;       // [g/mol]
    }
    equationOfState
    {
        rho             1.196;
    }
    thermodynamics
    {
        Cp          1005;       // [J/kg/K]
        Hf          0;
    }
    transport
    {
        mu          1.8e-05;    // [kg/m/s]
        Pr          0.7;
    }
}

// ************************************************************************* //
